# Pandas

## Series

In [1]:
import numpy as np
import pandas as pd

In [3]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.array

<PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = pd.Series([4, 7, 5, 3], index = ["d", "b", "a", "c"])
obj2

d    4
b    7
a    5
c    3
dtype: int64

In [16]:
sdata = {
    "Ohio": 35000,
    "Texas": 71000,
    "Oregon": 16000,
    "Utah": 5000
}

obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [17]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [18]:
states = ["California", "Ohio", "Oregon", "Texas"]
obj4 = pd.Series(sdata, index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [19]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [22]:
obj4.name = "population"
obj4.index.name = "state"
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [23]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [24]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DataFrames

In [27]:
data = {
    "state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
    "year": [2000, 2001, 2002, 2001, 2002, 2003],
    "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [28]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [29]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [32]:
frame2 = pd.DataFrame(data, columns = ["year", "state", "pop", "debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [39]:
frame2.columns
frame2.index = [6, 7, 8, 9, 10, 11]

In [42]:
frame2.iloc[1:5].loc[6:9, "year"]

7    2001
8    2002
9    2001
Name: year, dtype: int64

In [46]:
frame2bis = pd.DataFrame(data, columns = ["year", "state", "pop", "debt"])
frame2bis

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [50]:
frame2bis["debt"] = 16.5
frame2bis["debt"] = np.arange(6.)
frame2bis

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [52]:
val = pd.Series([-1.2, -1.5, -1.7, -2], index = ["two", "four", "five", 0])
frame2bis["add"] = val # Only present indices are added
frame2bis

   year   state  pop  debt  add
0  2000    Ohio  1.5   0.0 -2.0
1  2001    Ohio  1.7   1.0  NaN
2  2002    Ohio  3.6   2.0  NaN
3  2001  Nevada  2.4   3.0  NaN
4  2002  Nevada  2.9   4.0  NaN
5  2003  Nevada  3.2   5.0  NaN

In [54]:
frame2bis["eastern"] = frame2bis["state"] == "Ohio"
frame2bis

   year   state  pop  debt  add  eastern
0  2000    Ohio  1.5   0.0 -2.0     True
1  2001    Ohio  1.7   1.0  NaN     True
2  2002    Ohio  3.6   2.0  NaN     True
3  2001  Nevada  2.4   3.0  NaN    False
4  2002  Nevada  2.9   4.0  NaN    False
5  2003  Nevada  3.2   5.0  NaN    False

In [56]:
del frame2bis["eastern"]
frame2bis.columns

Index(['year', 'state', 'pop', 'debt', 'add'], dtype='object')